Revit 2027 API
ParameterTypeId.ViewportViewName Property
 "View Name"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewportViewName { get; }
Public Shared ReadOnly Property ViewportViewName As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewportViewName {
	ForgeTypeId^ get ();
}
static member ViewportViewName : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace